# Pandas:

### _The two main data structures provided by Pandas are the Series and DataFrame_

## Series

####  Example1

In [1]:
import pandas as pd


data = [10, 20, 30, 40, 50]
s = pd.Series(data)


print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

#### Example 2

In [2]:
import numpy as np
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [3]:
a1 = pd.Series(my_data,labels)

In [4]:
a2 = pd.Series(d)

In [5]:
a1

a    10
b    20
c    30
dtype: int64

In [6]:
a2

a    10
b    20
c    30
dtype: int64

In [7]:
a1+a2

a    20
b    40
c    60
dtype: int64

In [8]:
a1/a2

a    1.0
b    1.0
c    1.0
dtype: float64

In [9]:
a1-a2

a    0
b    0
c    0
dtype: int64

In [10]:
a2-a1

a    0
b    0
c    0
dtype: int64

In [11]:
a1*a2

a    100
b    400
c    900
dtype: int64

In [12]:
a1**a2

a            10000000000
b   -2101438300051996672
c    2565992168703393792
dtype: int64

In [13]:
a1%a2

a    0
b    0
c    0
dtype: int64

## Data Frames

#### Example 1

In [14]:
import pandas as pd 

data = {'name': ['Raki', 'Pooja', 'Anil', 'Joda'],

'age': [20, 21, 22, 21], 

'city': ['Delhi', 'Hyderabad', 'Vizag', 'US']}

df = pd.DataFrame(data) 

df

    name  age       city
0   Raki   20      Delhi
1  Pooja   21  Hyderabad
2   Anil   22      Vizag
3   Joda   21         US

#### Example 2

In [15]:
from numpy.random import randn

In [16]:
np.random.seed(101)

In [17]:
d = pd.DataFrame(randn(5,4),('A','B','C','D','E'),('W','X','Y','Z'))

In [18]:
d

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Indexing and selecting subsets of the DataFrame

In [19]:
# select a row by label
df.loc[0]

name     Raki
age        20
city    Delhi
Name: 0, dtype: object

In [20]:
# select a column by label
df.loc[:, 'name']

0     Raki
1    Pooja
2     Anil
3     Joda
Name: name, dtype: object

In [21]:
# select a subset of rows and columns by label
df.loc[1:3, ['name', 'city']]

    name       city
1  Pooja  Hyderabad
2   Anil      Vizag
3   Joda         US

In [22]:
# select a row by integer location
df.iloc[0]

name     Raki
age        20
city    Delhi
Name: 0, dtype: object

In [23]:
# select a column by integer location
df.iloc[:, 0]

0     Raki
1    Pooja
2     Anil
3     Joda
Name: name, dtype: object

In [24]:
# select a subset of rows and columns by integer location
df.iloc[1:3, [0, 2]]

    name       city
1  Pooja  Hyderabad
2   Anil      Vizag

In [25]:
# Selects a subset of the DataFrame  that includes only the 'age' column.   
df[['age']]

   age
0   20
1   21
2   22
3   21

In [26]:
# selects a column of the DataFrame 
df['city']

0        Delhi
1    Hyderabad
2        Vizag
3           US
Name: city, dtype: object

### Conditional Selection

In [27]:
# select rows where age is greater than 21
df[df['age'] > 21]

   name  age   city
2  Anil   22  Vizag

In [28]:
# select rows where city is Hyderabad
df[df['city'] == 'Hyderabad']

    name  age       city
1  Pooja   21  Hyderabad

In [29]:
df_age_gt_21 = df.query('age > 21')

In [30]:
df_age_gt_21

   name  age   city
2  Anil   22  Vizag

#### Example:

In [31]:
# create a multi-index DataFrame
import pandas as pd
data = {'name': ['Raki', 'Pooja', 'Anil', 'Joda'],
        'age': [20, 21, 22, 21],
        'city': ['Delhi', 'Hyderabad', 'Vizag', 'US'],
        'gender': ['M', 'F', 'M', 'F'],
        'score': [85, 90, 92, 87]}
dfs = pd.DataFrame(data)
df = pd.DataFrame(data)

# create a multilevel index based on gender and city
df.set_index(['gender', 'city'], inplace=True)

In [32]:
df

                   name  age  score
gender city
M      Delhi       Raki   20     85
F      Hyderabad  Pooja   21     90
M      Vizag       Anil   22     92
F      US          Joda   21     87

In [33]:
# select rows with gender 'M' and city 'Delhi'
# access data using the multilevel index

df.loc[('M', 'Delhi'), :]

name     Raki
age        20
score      85
Name: (M, Delhi), dtype: object

In [34]:
# select rows with age greater than 20 and score greater than 85
df.loc[(df['age'] > 20) & (df['score'] > 85), :]

                   name  age  score
gender city
F      Hyderabad  Pooja   21     90
M      Vizag       Anil   22     92
F      US          Joda   21     87

In [35]:
# select the 'name' and 'score' columns for rows with age less than 22
df.loc[df['age'] < 22, ['name', 'score']]

                   name  score
gender city
M      Delhi       Raki     85
F      Hyderabad  Pooja     90
       US          Joda     87

In [36]:
# select rows where the 'name' column contains the letter 'a'
df[df['name'].str.contains('a')]

                   name  age  score
gender city
M      Delhi       Raki   20     85
F      Hyderabad  Pooja   21     90
       US          Joda   21     87

In [37]:
# select rows where the 'name' column ends with the letter 'a'
df[df['name'].str.endswith('a')]

                   name  age  score
gender city
F      Hyderabad  Pooja   21     90
       US          Joda   21     87

In [38]:
#DataFrame.columns attribute to see a list of all the column names in DataFrame
df.columns

Index(['name', 'age', 'score'], dtype='object')

In [39]:
# select the 'name' column where the 'city' column is 'Delhi'
dfs_delhi_names = dfs.loc[dfs['city'] == 'Delhi', 'name']

In [40]:
dfs_delhi_names

0    Raki
Name: name, dtype: object

In [41]:
## select the 'name' and 'age' columns where the 'city' column is 'Delhi'
dfs_delhi_names_ages = dfs.loc[dfs['city'] == 'Delhi', ['name', 'age']]

In [42]:
dfs_delhi_names_ages

   name  age
0  Raki   20

In [43]:
#insert a new column called 'city' at index 2 (i.e., the third column) with the specified values.
df.insert(loc=2, column='color', value=['Fair', 'White', 'Black', 'Brown'])

In [44]:
df

                   name  age  color  score
gender city
M      Delhi       Raki   20   Fair     85
F      Hyderabad  Pooja   21  White     90
M      Vizag       Anil   22  Black     92
F      US          Joda   21  Brown     87

## multiple condition

#### use the & operator for 'and' and | operator for 'or'

In [45]:
# filter based on multiple conditions
filtered_df = dfs[(dfs['age'] >= 21) & (dfs['gender'] == 'M')]

print(filtered_df)

   name  age   city gender  score
2  Anil   22  Vizag      M     92

## Built-in methods

Cross section function in pandas is used to extract a subset of rows or columns from a hierarchical dataframe, based on one or more labels in the index or column axis.

In [46]:
# extract all rows with gender M
print(df.xs('M', level='gender'))

       name  age  color  score
city
Delhi  Raki   20   Fair     85
Vizag  Anil   22  Black     92

the xs() function is used to extract all rows with gender M, regardless of city. The level='Gender' argument is used to specify the level of the hierarchical index that the cross section should be taken from.

### Missing data

__In pandas, missing data is represented by the NaN (Not a Number) value. Pandas provides several functions and methods for handling missing data in a dataframe.__

### Dropping missing data:

You can drop missing data using the dropna() method. This method removes any rows or columns that contain missing values. 

#### Example:

In [47]:
import pandas as pd

data = {'name': ['Rohan', 'Sara', 'Meena', 'Loki'],
        'age': [25, 32, None, 45],
        'gender': ['M', 'F', 'F', 'M'],
        'salary': [50000, None, 35000, 90000]}
        
df = pd.DataFrame(data)

# drop any rows that contain missing values
df = df.dropna()

In [48]:
df

    name   age gender   salary
0  Rohan  25.0      M  50000.0
3   Loki  45.0      M  90000.0

### Filling missing data:
You can fill missing data using the fillna() method. This method replaces any missing values with a specified value or using a specified method such as forward filling or backward filling. 

#### example:

In [49]:
import pandas as pd

data = {'name': ['Rohan', 'Sara', 'Meena', 'Loki'],
        'age': [25, 32, None, 45],
        'gender': ['M', 'F', 'F', 'M'],
        'salary': [50000, None, 35000, 90000]}
        
df = pd.DataFrame(data)

# fill missing values with a specific value
df = df.fillna(value=0)

# fill missing values using forward filling
df = df.fillna(method='ffill')

In [50]:
df

    name   age gender   salary
0  Rohan  25.0      M  50000.0
1   Sara  32.0      F      0.0
2  Meena   0.0      F  35000.0
3   Loki  45.0      M  90000.0

### Interpolating missing data: 

You can interpolate missing data using the interpolate() method. This method fills in missing values by using a linear interpolation between the values before and after the missing value. 

#### example:

In [51]:
import pandas as pd

data = {'name': ['Rohan', 'Sara', 'Meena', 'Loki'],
        'age': [25, 32, None, 45],
        'gender': ['M', 'F', 'F', 'M'],
        'salary': [50000, None, 35000, 90000]}
        
df = pd.DataFrame(data)

# interpolate missing values
df = df.interpolate()

In [52]:
df

    name   age gender   salary
0  Rohan  25.0      M  50000.0
1   Sara  32.0      F  42500.0
2  Meena  38.5      F  35000.0
3   Loki  45.0      M  90000.0

## Groupby

groupby is a powerful and versatile function in pandas that allows you to group data in a DataFrame based on the values of one or more columns. Once the data is grouped, you can perform various aggregate functions on it, such as mean, sum, count, etc.

In [53]:
import pandas as pd

# create a sample DataFrame
data = {
    'name': ['Loki', 'Pooja', 'Raki', 'Loki', 'Pooja', 'Raki'],
    'age': [25, 30, 35, 20, 25, 30],
    'salary': [50000, 60000, 70000, 45000, 55000, 65000]
}

df = pd.DataFrame(data)

# group the data by name and calculate the mean salary for each group
mean_salary_by_name = df.groupby('name').agg({'salary': 'mean'})

print(mean_salary_by_name)

        salary
name
Loki   47500.0
Pooja  57500.0
Raki   67500.0

In [54]:
df.groupby('name').describe()

        age                                                 salary           \
      count  mean       std   min    25%   50%    75%   max  count     mean
name
Loki    2.0  22.5  3.535534  20.0  21.25  22.5  23.75  25.0    2.0  47500.0
Pooja   2.0  27.5  3.535534  25.0  26.25  27.5  28.75  30.0    2.0  57500.0
Raki    2.0  32.5  3.535534  30.0  31.25  32.5  33.75  35.0    2.0  67500.0


               std      min      25%      50%      75%      max
name
Loki   3535.533906  45000.0  46250.0  47500.0  48750.0  50000.0
Pooja  3535.533906  55000.0  56250.0  57500.0  58750.0  60000.0
Raki   3535.533906  65000.0  66250.0  67500.0  68750.0  70000.0

In [55]:
df.groupby('name').describe().transpose()['Loki']

age     count        2.000000
        mean        22.500000
        std          3.535534
        min         20.000000
        25%         21.250000
        50%         22.500000
        75%         23.750000
        max         25.000000
salary  count        2.000000
        mean     47500.000000
        std       3535.533906
        min      45000.000000
        25%      46250.000000
        50%      47500.000000
        75%      48750.000000
        max      50000.000000
Name: Loki, dtype: float64

## Merging ,joining and Concatenating

Merging is used to combine data based on the values of one or more common columns. It is similar to a SQL join operation.

### Merging

In [56]:
import pandas as pd

# create two sample dataframes to merge
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'],
                    'value': [1, 2, 3, 4]})
df2 = pd.DataFrame({'key': ['B', 'D', 'E', 'F'],
                    'value': [5, 6, 7, 8]})

# merge the dataframes on the 'key' column
merged_df = pd.merge(df1, df2, on='key')

print(merged_df)

  key  value_x  value_y
0   B        2        5
1   D        4        6

### Joining

Joining is similar to merging but it is used to combine data based on the index instead of the values of one or more common columns.
#### Example

In [57]:
import pandas as pd

# create two sample dataframes to join
df1 = pd.DataFrame({'value': [1, 2, 3, 4]},
                   index=['A', 'B', 'C', 'D'])

df2 = pd.DataFrame({'value': [5, 6, 7, 8]},
                   index=['B', 'D', 'E', 'F'])

# add suffixes to overlapping column names
df1 = df1.add_suffix('_df1')
df2 = df2.add_suffix('_df2')

# join the dataframes on their indexes
joined_df = df1.join(df2, how='inner')

print(joined_df)

   value_df1  value_df2
B          2          5
D          4          6

### Concatenating

Concatenating is used to combine data from different sources into a single dataframe. It is useful when you have data in separate files or in separate parts of the same file.
#### Example

In [58]:
import pandas as pd

# create two sample dataframes to concatenate
df1 = pd.DataFrame({'value': [1, 2, 3]})
df2 = pd.DataFrame({'value': [4, 5, 6]})

# concatenate the dataframes vertically
concatenated_df = pd.concat([df1, df2])

print(concatenated_df)

   value
0      1
1      2
2      3
0      4
1      5
2      6

## Apply

The apply() method in pandas is used to apply a function along an axis of the DataFrame. It can be used to apply a predefined function or a user-defined function to each row or column of the DataFrame.

#### Example

In [59]:
import pandas as pd

df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

def sum_columns(row):
    return row['A'] + row['B']

df['C'] = df.apply(sum_columns, axis=1)

print(df)

   A  B  C
0  1  4  5
1  2  5  7
2  3  6  9

## Sorting and Ordering a dataframe

To sort a dataframe by a single column, you can specify the column name in the sort_values() method, and the method will return a sorted dataframe based on that column.

#### Example 1:

In [60]:
import pandas as pd

# create a sample dataframe
df = pd.DataFrame({'Name': ['Nihal', 'Satish', 'Joda', 'Sona'],
                   'Age': [25, 30, 20, 35],
                   'Salary': [50000, 60000, 45000, 70000]})

# sort the dataframe by Age column
sorted_df = df.sort_values('Age')

print(sorted_df)

     Name  Age  Salary
2    Joda   20   45000
0   Nihal   25   50000
1  Satish   30   60000
3    Sona   35   70000

#### Example 2:

In [61]:
import pandas as pd

# create a sample dataframe
df = pd.DataFrame({'Name': ['Nihal', 'Satish', 'Joda', 'Sona'],
                   'Age': [25, 30, 20, 35],
                   'Salary': [50000, 60000, 45000, 70000]})

# sort the dataframe by Age and Salary columns
sorted_df = df.sort_values(['Age', 'Salary'])

print(sorted_df)

     Name  Age  Salary
2    Joda   20   45000
0   Nihal   25   50000
1  Satish   30   60000
3    Sona   35   70000

#### Example 3:

In [62]:
import pandas as pd

# create a sample dataframe
df = pd.DataFrame({'Name':['Nihal', 'Satish', 'Joda', 'Sona'] ,
                   'Age': [25, 30, 20, 35],
                   'Salary': [50000, 60000, 45000, 70000]})

# sort the dataframe by Age column in descending order
sorted_df = df.sort_values('Age', ascending=False)

print(sorted_df)

     Name  Age  Salary
3    Sona   35   70000
1  Satish   30   60000
0   Nihal   25   50000
2    Joda   20   45000

## Pivot table

A pivot table is a summary table that is used to aggregate and organize data. It allows you to summarize and analyze large datasets by grouping the data according to one or more criteria and then performing calculations on the grouped data.

In pandas, we can create a pivot table using the pivot_table method. The method takes several parameters, including the data frame to pivot, the index (or row) columns, the column(s) to pivot, the aggregation function to use, and any additional options.

In [63]:
import pandas as pd

# create a sample data frame
df = pd.DataFrame({'name': ['Nihal', 'Satish','Loki' ,'Joda', 'Sona'],
                   'gender': ['M', 'M', 'M', 'F', 'F'],
                   'age': [25, 30, 35, 40, 45],
                   'income': [50000, 60000, 70000, 80000, 90000]})

# create a pivot table that shows the average income by gender and age
pivot_table = pd.pivot_table(df, index=['gender', 'age'], values='income', aggfunc='mean')

# print the pivot table
print(pivot_table)

            income
gender age
F      40    80000
       45    90000
M      25    50000
       30    60000
       35    70000